; domain
; PDDL domain problem: NO axioms integration! The axioms have been COMPLETELY moved into the ASP file.

(define (domain dntp)
  (:requirements :strips :typing :equality :negative-preconditions :disjunctive-preconditions :conditional-effects :existential-preconditions)
  (:types
    node - object
    primary secondary - node
  )
  (:predicates
    (conn  ?x - node ?y - node)
    (close ?x - node ?y - node)
    (rem   ?x - node ?y - node)
    (full  ?x - secondary)
    (buildable ?x - node ?y - node)
    (mutable   ?x - node ?y - node)
    (le        ?x - node ?y - node)
  )

  (:action insP
    :parameters (?s - secondary ?p - primary)
    :precondition (and (buildable ?s ?p) (not (conn ?s ?p)) (not (rem ?s ?p)) (not (full ?s)))
    :effect (and (conn ?s ?p) (not (close ?s ?p)) (full ?s)))
  (:action insS
    :parameters (?s1 - secondary ?s2 - secondary)
    :precondition (and (le ?s1 ?s2) (buildable ?s1 ?s2) (not (conn ?s1 ?s2)) (not (rem ?s1 ?s2)) (not (full ?s1)) (not (full ?s2)))
    :effect (and (conn ?s1 ?s2) (not (close ?s1 ?s2)) (full ?s1) (full ?s2)))
  (:action delP
    :parameters (?s - secondary ?p - primary)
    :precondition (and (conn ?s ?p) (mutable ?s ?p) (not (close ?s ?p)) (full ?s))
    :effect (and (not (conn ?s ?p)) (rem ?s ?p) (not (full ?s))))
  (:action delS
    :parameters (?s1 - secondary ?s2 - secondary)
    :precondition (and (le ?s1 ?s2) (conn ?s1 ?s2) (mutable ?s1 ?s2) (not (close ?s1 ?s2)) (full ?s1) (full ?s2))
    :effect (and (not (conn ?s1 ?s2)) (rem ?s1 ?s2) (not (full ?s1)) (not (full ?s2))))
  (:action sw
    :parameters (?u - secondary ?v - node ?vp - node)
    :precondition (and (not (= ?u ?v)) (not (= ?u ?vp)) (not (= ?v ?vp))
      (imply (le ?u ?v)  (and (conn ?u ?v) (close ?u ?v)))
      (imply (le ?v ?u)  (and (conn ?v ?u) (close ?v ?u)))
      (imply (le ?u ?vp) (and (conn ?u ?vp) (not (close ?u ?vp))))
      (imply (le ?vp ?u) (and (conn ?vp ?u) (not (close ?vp ?u)))))
    :effect (and
      (when (le ?u ?v)  (not (close ?u ?v)))
      (when (le ?v ?u)  (not (close ?v ?u)))
      (when (le ?u ?vp) (close ?u ?vp))
      (when (le ?vp ?u) (close ?vp ?u))))
)

; problem
(define (problem disnet68n) (:domain dntp)
(:objects
	S1 S2 S3 S4 S5 S6 S7 S8 S9 S10 - secondary
	P11 P12 - primary
)
(:init
	(conn S1 P11)
	(conn S1 S4)
	(conn S2 S5)
	(conn S2 S9)
	(conn S3 P12)
	(conn S3 S7)
	(conn S4 P12)
	(conn S5 S10)
	(conn S6 S8)
	(conn S6 S9)
	(conn S7 S8)
	(conn S10 P11)
	(close S1 P11)
	(close S2 S5)
	(close S3 P12)
	(close S3 S7)
	(close S4 P12)
	(close S5 S10)
	(close S6 S8)
	(close S6 S9)
	(close S7 S8)
	(close S10 P11)
	(buildable S1 P12)
	(buildable S2 P11)
	(buildable S2 S10)
	(buildable S4 S10)
	(buildable S5 P11)
	(buildable S5 S9)
	(mutable S1 P11)
	(mutable S2 S5)
	(mutable S2 S9)
	(mutable S4 P12)
	(mutable S5 S10)
	(mutable S10 P11)
	(le P11 P12)
	(le S1 P11)
	(le S1 P12)
	(le S1 S2)
	(le S1 S3)
	(le S1 S4)
	(le S1 S5)
	(le S1 S6)
	(le S1 S7)
	(le S1 S8)
	(le S1 S9)
	(le S1 S10)
	(le S2 P11)
	(le S2 P12)
	(le S2 S3)
	(le S2 S4)
	(le S2 S5)
	(le S2 S6)
	(le S2 S7)
	(le S2 S8)
	(le S2 S9)
	(le S2 S10)
	(le S3 P11)
	(le S3 P12)
	(le S3 S4)
	(le S3 S5)
	(le S3 S6)
	(le S3 S7)
	(le S3 S8)
	(le S3 S9)
	(le S3 S10)
	(le S4 P11)
	(le S4 P12)
	(le S4 S5)
	(le S4 S6)
	(le S4 S7)
	(le S4 S8)
	(le S4 S9)
	(le S4 S10)
	(le S5 P11)
	(le S5 P12)
	(le S5 S6)
	(le S5 S7)
	(le S5 S8)
	(le S5 S9)
	(le S5 S10)
	(le S6 P11)
	(le S6 P12)
	(le S6 S7)
	(le S6 S8)
	(le S6 S9)
	(le S6 S10)
	(le S7 P11)
	(le S7 P12)
	(le S7 S8)
	(le S7 S9)
	(le S7 S10)
	(le S8 P11)
	(le S8 P12)
	(le S8 S9)
	(le S8 S10)
	(le S9 P11)
	(le S9 P12)
	(le S9 S10)
	(le S10 P11)
	(le S10 P12)
)
(:goal
	(and
		(conn S1 P12)
		(conn S1 S4)
		(conn S2 P11)
		(conn S2 S10)
		(conn S3 P12)
		(conn S3 S7)
		(conn S4 S10)
		(conn S5 P11)
		(conn S5 S9)
		(conn S6 S8)
		(conn S6 S9)
		(conn S7 S8)
		(not (conn S1 P11))
		(not (conn S2 S5))
		(not (conn S2 S9))
		(not (conn S4 P12))
		(not (conn S5 S10))
		(not (conn S10 P11))
		(close S1 P12)
		(close S1 S4)
		(close S2 P11)
		(close S3 P12)
		(close S3 S7)
		(close S4 S10)
		(close S5 P11)
		(close S5 S9)
		(close S6 S9)
		(close S7 S8)
		(not (close S2 S10))
		(not (close S6 S8))
	)
)
)

; plan
1. (insp s1 p12)
   added: (conn s1 p12) (full s1)
   goals met: 12 of 30
2. (inss s4 s10)
   added: (conn s4 s10) (full s4) (full s10)
   goals met: 13 of 30
3. (inss s5 s9)
   added: (conn s5 s9) (full s5) (full s9)
   goals met: 14 of 30
4. (insp s2 p11)
   added: (conn s2 p11) (full s2)
   goals met: 15 of 30
5. (dels s2 s9)
   deleted: (conn s2 s9) (full s2) (full s9)
   added: (rem s2 s9)
   goals met: 16 of 30
6. (sw s1 p11 p12)
   deleted: (close s1 p11)
   added: (close s1 p12)
   goals met: 17 of 30
7. (delp s1 p11)
   deleted: (conn s1 p11) (full s1)
   added: (rem s1 p11)
   goals met: 18 of 30
8. (sw s4 p12 s1)
   deleted: (close s4 p12)
   added: (close s1 s4)
   goals met: 19 of 30
9. (delp s4 p12)
   deleted: (conn s4 p12) (full s4)
   added: (rem s4 p12)
   goals met: 20 of 30
10. (sw s10 p11 s4)
   deleted: (close s10 p11)
   added: (close s4 s10)
   goals met: 21 of 30
11. (delp s10 p11)
   deleted: (conn s10 p11) (full s10)
   added: (rem s10 p11)
   goals met: 22 of 30
12. (inss s2 s10)
   added: (conn s2 s10) (full s2) (full s10)
   goals met: 23 of 30
13. (sw s2 s5 p11)
   deleted: (close s2 s5)
   added: (close s2 p11)
   goals met: 24 of 30
14. (dels s2 s5)
   deleted: (conn s2 s5) (full s2) (full s5)
   added: (rem s2 s5)
   goals met: 25 of 30
15. (insp s5 p11)
   added: (conn s5 p11) (full s5)
   goals met: 26 of 30
16. (sw s5 s10 p11)
   deleted: (close s5 s10)
   added: (close s5 p11)
   goals met: 27 of 30
17. (dels s5 s10)
   deleted: (conn s5 s10) (full s5) (full s10)
   added: (rem s5 s10)
   goals met: 28 of 30
18. (sw s9 s6 s5)
   deleted: (close s6 s9)
   added: (close s5 s9)
   goals met: 28 of 30
19. (sw s6 s8 s9)
   deleted: (close s6 s8)
   added: (close s6 s9)
   goals met: 30 of 30
